---
kind: enumMember
id: F:Autodesk.Revit.DB.Mechanical.EquipmentClassification.Pump
enum: Autodesk.Revit.DB.Mechanical.EquipmentClassification
source: html/0d5a0690-23dc-2023-389c-42e169d2d7fb.htm
---
# Autodesk.Revit.DB.Mechanical.EquipmentClassification.Pump

The pump equipment.